package hw7.hw7_16;

/*Коли пошукова система Goo знайшла довгий текст і його потрібно показати користувачеві на сторінці знайдених результатів,
то такий текст потрібно обрізати.
Текст обрізається за таким алгоритмом:
якщо довжина тексту 15 або менше символів - текст залишається як є;
якщо довжина тексту 16 і більше символів - то беруться перші 15 символів.
 Якщо наступний символ після перших 15 символів не є пробілом - до результату ще додаються три точки ...
(тому що ми розрізали якесь слово).*/

public class SummaryCreator {
    public String create(String text){
        if (text.length()>15){
            if (text.charAt(15)!=32){
                return text.substring(0,15)+("...");
            }else {
                return text.substring(0,15);
            }
        }
        return text;
    }

}
