package hw7.hw7_22;

/*Бувають такі тексти, після прочитання яких ми не отримуємо нову інформацію.
У таких текстах дуже багато води - марної інформації.
Деякі автори текстів люблять додавати по два і більше пробілів між словами,
і виходить, що загалом текст вийшов довшим (символів більше), але користі в тексті не додалося.
Напиши програму, яка визначатиме такі водянисті тексти.
Водянистістю називатимемо ставлення числа прогалин у тексті до загальної кількості символів у тексті.*/

public class WaterCounter {
    public double count(String text){
        int spase = 0;
        spase = text.length() - text.replace(" ", "").length();
        return (double) spase/text.length();
    }
}
